In [1]:
import pandas as pd
import numpy as np
from path import Path

import os,sys
parentdir = Path(os.path.abspath("../.."))
sys.path.insert(0,parentdir)

# Get the DB password
from config import db_password
from sqlalchemy import create_engine

In [2]:
# Read the raw us cities data file
file_path = Path("../../data/raw/uscities.csv")
city_df = pd.read_csv(file_path)
print(city_df.shape)
city_df.head()

(28372, 17)

,city,city_ascii,state_id,state_name,county_fips,county_name,lat,lng,population,density,source,military,incorporated,timezone,ranking,zips,id
0,New York,New York,NY,New York,36061,New York,40.6943,-73.9249,18713220,10715.0,polygon,False,True,America/New_York,1,11229 11226 11225 11224 11222 11221 11220 1138...,1840034016
1,Los Angeles,Los Angeles,CA,California,6037,Los Angeles,34.1139,-118.4068,12750807,3276.0,polygon,False,True,America/Los_Angeles,1,90291 90293 90292 91316 91311 90037 90031 9000...,1840020491
2,Chicago,Chicago,IL,Illinois,17031,Cook,41.8373,-87.6862,8604203,4574.0,polygon,False,True,America/Chicago,1,60018 60649 60641 60640 60643 60642 60645 6064...,1840000494
3,Miami,Miami,FL,Florida,12086,Miami-Dade,25.7839,-80.2102,6445545,5019.0,polygon,False,True,America/New_York,1,33129 33125 33126 33127 33128 33149 33144 3314...,1840015149
4,Dallas,Dallas,TX,Texas,48113,Dallas,32.7936,-96.7662,5743938,1526.0,polygon,False,True,America/Chicago,1,75287 75098 75233 75254 75251 75252 75253 7503...,1840019440

In [3]:
# Drop the columns not required
city_df.drop(columns=["city_ascii","county_fips","lat","lng","population","density","source","military","incorporated","timezone","ranking","zips","id"],inplace=True)

print(city_df.shape)
city_df.sample(n=10)

(28372, 4)

                   city state_id    state_name      county_name
12097         New Paris       OH          Ohio           Preble
921       Arroyo Grande       CA    California  San Luis Obispo
1620             Walnut       CA    California      Los Angeles
7754   Camino Tassajara       CA    California     Contra Costa
7950          Riverdale       CA    California           Fresno
20481        Oak Island       TX         Texas         Chambers
16401          Kinmundy       IL      Illinois           Marion
913          Stonecrest       GA       Georgia           DeKalb
18466   Juniata Terrace       PA  Pennsylvania          Mifflin
18471        Fort Yukon       AK        Alaska    Yukon-Koyukuk

In [4]:
# Get cities and counties only for FL and CA
city_df_ca_fl = city_df.loc[city_df["state_id"].isin(['FL','CA'])]
city_df_ca_fl

                    city state_id  state_name    county_name
1            Los Angeles       CA  California    Los Angeles
3                  Miami       FL     Florida     Miami-Dade
12         San Francisco       CA  California  San Francisco
14             San Diego       CA  California      San Diego
16                 Tampa       FL     Florida   Hillsborough
...                  ...      ...         ...            ...
28281  Sugarloaf Village       CA  California         Tulare
28294             Cuyama       CA  California  Santa Barbara
28319           Cobbtown       FL     Florida     Santa Rosa
28326            Cartago       CA  California           Inyo
28367          Poso Park       CA  California         Tulare

[2381 rows x 4 columns]

In [5]:
#Export the data to CSV
file_path_export=Path("../../data/processed/city_county_mapping.csv")
city_df_ca_fl.to_csv(file_path_export,index=False)

In [6]:
#Load data to database
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/covid_property_pandemic"
engine = create_engine(db_string)
city_df_ca_fl.to_sql(name='city_county_mapping', con=engine, if_exists='replace')